//除，取余，自加
#include <stdio.h>

void main(){
    //除
    //处理的流程：10/4=2.5-->截取整数--> 2 -->由于是浮点数，加小数点-->2.000000
    double d1 = 10/4;//整数运算，出来的只有整数结果
    double d2 = 10.0/4;//希望保留运算的小数，则参与运算的数值必须至少有一个为浮点数
    printf("d1=%f;d2=%f\n", d1, d2);//若要限制小数位数，可以用%.位数f

    //取余
    //按照计算机内置公式来运算的：a%b = a-a/b*b
    int res1 = 10 % 3;//余1
    int res2 = -10 % 3;//-10-(-10)/3*3=-10-(-3)*3=-1    //其中-10/3的结果只取整数，为-3
    int res3 = 10 % -3;//10-10/(-3)*(-3)=10-(-3)*(-3)=1 //其中10/(-3)的结果只取整数，为-3
    int res4 = -10 % -3;//-10-(-10)/(-3)*(-3)=-10-3*(-3)=-10+9=-1   //其中(-10)/(-3)的结果只取整数，为-3
    printf("res1=%d;res2=%d;res3=%d;res4=%d\n", res1, res2, res3, res4);

    //++
    //k++和k--可以独立使用
    //k++ = ++k = k+1   //自减相同
    int i = 10;
    int j = i++;//等价于：int j = i;i = i + 1;  //先赋值，再自增==》j = 10; i = 11;
    int k = ++i;//等价于：i = i + 1;int k = i;  //先自增，再赋值==》i = 12; k = 12;
    printf("i=%d; j=%d; k=%d", i, j, k);    //注意运算顺序
}